
&НаСервереБезКонтекста
Процедура ЗарегистрироватьНаСервере(НоменклатураДляРегистрации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&НоменклатураДляРегистрации)";
	
	Запрос.УстановитьПараметр("НоменклатураДляРегистрации", НоменклатураДляРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.ОбменССайтом.НайтиПоНаименованию("Выгрузка товаров"), ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаЗавершение", ЭтотОбъект),"Вся номенклатура из выбранной группы будет зарегистрирована для выгрузки на сайт, продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗарегистрироватьНаСервере(НоменклатураДляРегистрации);
	КонецЕсли;
		
КонецПроцедуры