
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Узел");
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	ПараметрСКД.Значение = ПланыОбмена.ОбменССайтом.НайтиПоНаименованию("Выгрузка товаров");
	ПараметрСКД.Использование = Истина;
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("ВидЦены");
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	ПараметрСКД.Значение = Справочники.ВидыЦен.НайтиПоНаименованию("Розничная Вавилон из ЦУ");
	ПараметрСКД.Использование = Истина;

	МассивСкладов = Новый Массив;
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("1 Склад Мега"));
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("4 Склад «Золотой Вавилон»"));
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("5 Склад ""Горизонт"""));
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("6 Склад Вавилон2"));
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("7 Склад Мегамаг"));
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("Склад интернет магазина"));
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("не использовать 2 Склад А"));
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("не использовать 3 Склад Б"));
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("8 Склад хранения"));
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("9 Склад Мега Теплый Стан"));
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("Склад Орбита"));
	
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("СписокСкладов");
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	ПараметрСКД.Значение = МассивСкладов;
	ПараметрСКД.Использование = Истина;                             

	                             
КонецПроцедуры                                           


Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");
	ПараметрыРегистрации.Вставить("Наименование", "Отчет по номенклатуре выгружаемой на сайт");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Версия", "1.0");    
	ПараметрыРегистрации.Вставить("Информация", "Отчет по номенклатуре выгружаемой на сайт");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Отчет по номенклатуре выгружаемой на сайт", "ОтчетПоИзменениям", "ОткрытиеФормы", Истина, "");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции


Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;	
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции


Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры