
&НаКлиенте
Процедура Заполнить(Команда)
	Чтение = Новый ЧтениеТекста(ПутьКФайлу);
	
	Стр = Чтение.ПрочитатьСтроку();
	
	Название = "";
	Тип = "";
	
	Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки
		
		Если СтрНайти(Стр, "Название =") Тогда
			Название = СокрЛП(СтрЗаменить(Стр, "Название = ", ""));
		ИначеЕсли СтрНайти(Стр, "Тип =") Тогда
			Тип = СокрЛП(СтрЗаменить(Стр, "Тип = ", ""))
		ИначеЕсли СтрНайти(Стр, "Значения:") Тогда
		ИначеЕсли СтрНайти(Стр, "----------") Тогда
		Иначе
			НоваяСтрока = ТаблицаСвойств.Добавить();
			НоваяСтрока.Название = Название;
			НоваяСтрока.Тип = Тип;
			НоваяСтрока.Значение = Стр;
		КонецЕсли;
		
		Стр = Чтение.ПрочитатьСтроку();

	КонецЦикла;
	
	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСвойстваНаСервере()
	
	Для Каждого СтрокаТаблицы Из ТаблицаСвойств Цикл
		
		ИмяРеквизита = СтрокаТаблицы.Название;
		
		//пробуем найти доп. реквизит по заголовку
		ЭлПВХ_Ссылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", ИмяРеквизита);
		Если ЭлПВХ_Ссылка.Пустая() Тогда
			//если не найдено, то создадим новый
			ЭлПВХ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
			ЭлПВХ.Заголовок = ИмяРеквизита;
			ЭлПВХ.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие;
			ЭлПВХ.Наименование = ЭлПВХ.Заголовок+" ("+ЭлПВХ.НаборСвойств+")";
			ЭлПВХ.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов");
			ЭлПВХ.Имя = ИмяРеквизита;
			ЭлПВХ.ЭтоДополнительноеСведение = Истина;
			ЭлПВХ.Виден = Истина;
			ЭлПВХ.Записать();
			ЭлПВХ_Ссылка = ЭлПВХ.Ссылка;
			
			НаборОб = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие.ПолучитьОбъект();
			Если НаборОб.ДополнительныеРеквизиты.Найти(ЭлПВХ_Ссылка, "Свойство") = Неопределено Тогда
				//добавим реквизит в набор
				СтрНаборОб = НаборОб.ДополнительныеСведения.Добавить();
				СтрНаборОб.Свойство = ЭлПВХ_Ссылка;
			КонецЕсли;
			Если НаборОб.Модифицированность() Тогда
				//запишем при необходимости
				НаборОб.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если НЕ СвойствоЗаведено(ЭлПВХ_Ссылка, СтрокаТаблицы.Значение) Тогда
			
			НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			НовоеЗначение.Владелец = ЭлПВХ_Ссылка;
			НовоеЗначение.Наименование = СтрокаТаблицы.Значение;
			НовоеЗначение.ПолноеНаименование = СтрокаТаблицы.Значение;
			НовоеЗначение.Записать()
		КонецЕсли;
		
		
	КонецЦикла;

	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСвойства(Команда)
	СоздатьСвойстваНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПутьКФайлу = "E:\Prog9\ТЗ 245\классификатор свойств.txt";
КонецПроцедуры


&НаСервере
Функция СвойствоЗаведено(Свойство, Значение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Владелец = &Владелец
		|	И ЗначенияСвойствОбъектов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Владелец", Свойство);
	Запрос.УстановитьПараметр("Наименование", Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь
	Иначе
		Возврат Истина
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Отказываемся от стандартной обработки процедуры
	СтандартнаяОбработка = Ложь;
	
	// Создаем диалог выбора файла и указываем для чего он будет использоваться
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	// Задаем фильтр доступных расширений файлов для выбора
	Диалог.Фильтр = НСтр("Файл классификатора (*.txt)|*.txt");
	// Задаем текст заголовка окна выбора
	Диалог.Заголовок = НСтр("Выберите файл классификатора");
	// Создаем объект ОписаниеОповещения, который будет передан в метод Показать
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	// Открываем окно выбора файла
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ПутьКФайлу = ВыбранныеФайлы[0];
		
	КонецЕсли;
	
КонецПроцедуры
