&Вместо("ОбработкаВыбораОбособленногоПодразделения")
Процедура ОбработкаВыбораОбособленногоПодразделенияКорректировка(Ответ, ДопПараметры) Экспорт 
	Если Ответ <> Неопределено Тогда 
		Форма = ДопПараметры.Форма;
		Форма.Модифицированность = Истина;
		
		// ++++++ Добавил 11.03.20
		//Форма.ОбособленноеПодразделение.Добавить(Ответ);

		Форма.ОбособленноеПодразделение.Очистить();
		Для Каждого ЗначениеМассива Из Ответ Цикл
		   Форма.ОбособленноеПодразделение.Добавить(ЗначениеМассива);
		КонецЦикла;
		// ------
		
		Форма.ИсключитьДанныеОбособленныхПодразделений = Ложь;
		
		Если ЗначениеЗаполнено(Форма.ОбособленноеПодразделение) Тогда 
			РегламентированнаяОтчетностьВызовСервера.ОпределитьНаличиеКодаПодразделенияВСправочникеОрганыФСГС(Форма.ОбособленноеПодразделение);
		КонецЕсли;
		
		Если Форма.Элементы.Найти("ПолеТабличногоДокументаФормаОтчета") <> Неопределено Тогда 
			Если Форма.ПолеТабличногоДокументаФормаОтчета.Области.Найти("ОбособленноеПодразделение") <> Неопределено Тогда 
				Форма.ПолеТабличногоДокументаФормаОтчета.Области.ОбособленноеПодразделение.Значение = Ответ;
			КонецЕсли;
			Если Форма.ПолеТабличногоДокументаФормаОтчета.Области.Найти("ИсключитьДанныеОбособленныхПодразделений") <> Неопределено Тогда 
				Форма.ПолеТабличногоДокументаФормаОтчета.Области.ИсключитьДанныеОбособленныхПодразделений.Значение = Ложь;
			КонецЕсли;
		ИначеЕсли Форма.Элементы.Найти("ТабличныйДокумент") <> Неопределено Тогда
			Если Форма.ТабличныйДокумент.Области.Найти("ОбособленноеПодразделение") <> Неопределено Тогда 
				Форма.ТабличныйДокумент.Области.ОбособленноеПодразделение.Значение = Ответ;
			КонецЕсли;
			Если Форма.ТабличныйДокумент.Области.Найти("ИсключитьДанныеОбособленныхПодразделений") <> Неопределено Тогда 
				Форма.ТабличныйДокумент.Области.ИсключитьДанныеОбособленныхПодразделений.Значение = Ложь;
			КонецЕсли;
		КонецЕсли;
		Форма.ОбособленноеПодразделениеПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры
