ВЫБРАТЬ
	СУММА(Док.Сумма) КАК Сумма,
	СУММА(Док.Цена * Док.Количество - Док.Сумма) КАК СуммаСкидок,
	СУММА(ВЫБОР
			КОГДА Док.Сумма > 0
				ТОГДА Док.Сумма
			ИНАЧЕ 0
		КОНЕЦ) КАК Итого,
	СУММА(ВЫБОР
			КОГДА Док.Сумма > 0
				ТОГДА 0
			ИНАЧЕ -Док.Сумма
		КОНЕЦ) КАК ИтогоВозврат,
	Док.Ссылка,
	СУММА(ВЫБОР
			КОГДА Док.Сумма > 0
				ТОГДА Док.Цена * Док.Количество - Док.Сумма
			ИНАЧЕ 0
		КОНЕЦ) КАК ИтогоСкидкаВПродажах,
	СУММА(ВЫБОР
			КОГДА Док.Сумма > 0
				ТОГДА 0
			ИНАЧЕ Док.Цена * Док.Количество - Док.Сумма
		КОНЕЦ) КАК ИтогоСкидкаВВозвратах
ПОМЕСТИТЬ Товары
ИЗ
	Документ.ОтчетОРозничныхПродажах.Товары КАК Док
ГДЕ
	Док.Ссылка = &ТекущийДокумент

СГРУППИРОВАТЬ ПО
	Док.Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка,
	СУММА(ВЫБОР
			КОГДА ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма > 0
				ТОГДА ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма
			ИНАЧЕ 0
		КОНЕЦ) КАК СуммаПродаж,
	СУММА(ВЫБОР
			КОГДА ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма > 0
				ТОГДА 0
			ИНАЧЕ ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма
		КОНЕЦ) КАК СуммаВозвратов
ПОМЕСТИТЬ Безнал
ИЗ
	Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартами КАК ОтчетОРозничныхПродажахОплатаПлатежнымиКартами
ГДЕ
	ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка = &ТекущийДокумент

СГРУППИРОВАТЬ ПО
	ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Товары.Сумма,
	Товары.СуммаСкидок,
	Товары.Ссылка,
	Товары.Итого,
	Товары.ИтогоВозврат,
	Товары.ИтогоСкидкаВПродажах,
	Товары.ИтогоСкидкаВВозвратах,
	Безнал.СуммаПродаж,
	Безнал.СуммаВозвратов
ИЗ
	Товары КАК Товары
		ЛЕВОЕ СОЕДИНЕНИЕ Безнал КАК Безнал
		ПО Товары.Ссылка = Безнал.Ссылка
