&Вместо("ОбработкаВыбораПоляОбособленныхПодразделений")
Процедура ОбработкаВыбораПоляОбособленныхПодразделенийКорректировка(Форма, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура("Владелец", Форма.СтруктураРеквизитовФормы.Организация);
	Если ЗначениеЗаполнено(Форма.ИмяРеквизитаПризнакаОбособленногоПодразделения) Тогда
		Отбор.Вставить(Форма.ИмяРеквизитаПризнакаОбособленногоПодразделения, Истина);
	КонецЕсли;
	Если Форма.ИмяФормы = "Отчет.РегламентированныйОтчетСтатистикаФормаП4.Форма.ФормаОтчета2020Кв1" Тогда
		Параметры = Новый Структура("Отбор, РежимВыбора, Отображение, МножественныйВыбор", Отбор, Истина, "Список", Истина);
	Иначе
		Параметры = Новый Структура("Отбор, РежимВыбора, Отображение", Отбор, Истина, "Список");
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаВыбораОбособленногоПодразделения", РегламентированнаяОтчетностьКлиент, Новый Структура("Форма", Форма));
	ОткрытьФорму("Справочник." + Форма.ИмяСправочникаОбособленныхПодразделений + ".ФормаВыбора",Параметры,Форма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры
