&НаСервереБезКонтекста
Функция ПолучитьТаблицуДатЗаПериод(НачДата, КонДата, Интервал = "ДЕНЬ")
	
	тзИнтервалов = Новый ТаблицаЗначений;
	тзИнтервалов.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|   НАЧАЛОПЕРИОДА(&НачДата, День) КАК НачИнтервала
	|УПОРЯДОЧИТЬ ПО
	|   НачИнтервала
	|ИТОГИ ПО
	|   НачИнтервала ПЕРИОДАМИ("+Интервал+", &НачДата, &КонДата)";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НачИнтервала", "ВСЕ");
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = тзИнтервалов.Добавить();
		НоваяСтрока.Период = Выборка.НачИнтервала;
	КонецЦикла;
	
	Возврат  тзИнтервалов;
	
КонецФункции //ПолучитьТаблицуДатЗаПериод(
