&НаСервере
Процедура ЗаполнитьНаСервере()
	
	НоменклатураПолученная = Номенклатура.ПолучитьОбъект();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Вид препарата"));
	Массив = НоменклатураПолученная.ДополнительныеРеквизиты.НайтиСтроки(ПараметрыОтбора);
	Если Массив.Количество() = 0 Тогда
		НовоеСвойство = НоменклатураПолученная.ДополнительныеРеквизиты.Добавить();
		НовоеСвойство.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Вид препарата");
		НовоеСвойство.Значение = ВидПрепарата;
	Иначе
		Массив[0].Значение = ВидПрепарата;
	КонецЕсли;	
	
	НоменклатураПолученная.Записать();
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
